data/Parm_PH_29/alpha_05/alpha_05_10071_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00230970 -0.00004266 0.00000000 0.00002254 0.00000000 0.00231739)
(-0.00003794 0.00000652 0.00000000 0.00000073 0.00000000 -0.00003258)
(0.00000469 0.00000172 0.00000000 -0.00000936 0.00000000 0.00005907)
(0.00000468 0.00002068 0.00000000 -0.00006141 0.00000000 0.00006562)
(0.00003048 -0.00004732 0.00000000 0.00007816 0.00000000 0.00027148)
(0.00001671 -0.00001721 0.00000000 0.00001476 0.00000000 0.00029711)
(-0.00000298 0.00000069 0.00000000 0.00000767 0.00000000 0.00028068)
(0.00002310 -0.00002081 0.00000000 0.00001818 0.00000000 0.00030489)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
